---
kind: method
id: M:Autodesk.Revit.DB.NurbSpline.SetControlPointsAndWeights(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.DoubleArray)
source: html/1156d23e-92d4-7daa-42ca-519a9c28e947.htm
---
# Autodesk.Revit.DB.NurbSpline.SetControlPointsAndWeights Method

Set the control points, weights simultaneously.

## Syntax (C#)
```csharp
public void SetControlPointsAndWeights(
	IList<XYZ> ctrlPoints,
	DoubleArray weights
)
```

## Parameters
- **ctrlPoints** (`System.Collections.Generic.IList < XYZ >`)
- **weights** (`Autodesk.Revit.DB.DoubleArray`)